results/data/benchclient1/quarkus-io-thread-124000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 44.731ms, rate sampling interval: 244ms
  Thread calibration: mean lat.: 47.703ms, rate sampling interval: 245ms
  Thread calibration: mean lat.: 51.119ms, rate sampling interval: 287ms
  Thread calibration: mean lat.: 45.917ms, rate sampling interval: 238ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   199.48ms  322.35ms   2.23s    87.17%
    Req/Sec    31.06k     3.06k   39.34k    62.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   55.87ms
 75.000%  191.10ms
 90.000%  692.22ms
 99.000%    1.42s 
 99.900%    2.01s 
 99.990%    2.18s 
 99.999%    2.22s 
100.000%    2.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.045     0.000000            1         1.00
      10.215     0.100000       618288         1.11
      23.071     0.200000      1236636         1.25
      33.471     0.300000      1854615         1.43
      42.207     0.400000      2474794         1.67
      55.871     0.500000      3091565         2.00
      68.287     0.550000      3401331         2.22
      83.263     0.600000      3709243         2.50
     103.359     0.650000      4018828         2.86
     135.551     0.700000      4328224         3.33
     191.103     0.750000      4636888         4.00
     233.727     0.775000      4791311         4.44
     287.487     0.800000      4946324         5.00
     353.279     0.825000      5100348         5.71
     428.799     0.850000      5254768         6.67
     546.815     0.875000      5409647         8.00
     623.615     0.887500      5486949         8.89
     692.223     0.900000      5564364        10.00
     744.959     0.912500      5641105        11.43
     811.519     0.925000      5718474        13.33
     879.615     0.937500      5795662        16.00
     918.527     0.943750      5834559        17.78
     962.559     0.950000      5873175        20.00
    1015.807     0.956250      5911597        22.86
    1071.103     0.962500      5950605        26.67
    1134.591     0.968750      5988925        32.00
    1163.263     0.971875      6008739        35.56
    1190.911     0.975000      6027484        40.00
    1222.655     0.978125      6047073        45.71
    1263.615     0.981250      6066339        53.33
    1313.791     0.984375      6085683        64.00
    1335.295     0.985938      6095244        71.11
    1361.919     0.987500      6105005        80.00
    1396.735     0.989062      6114598        91.43
    1436.671     0.990625      6124128       106.67
    1478.655     0.992188      6133831       128.00
    1502.207     0.992969      6138601       142.22
    1532.927     0.993750      6143486       160.00
    1571.839     0.994531      6148211       182.86
    1612.799     0.995313      6153111       213.33
    1650.687     0.996094      6157943       256.00
    1682.431     0.996484      6160314       284.44
    1737.727     0.996875      6162714       320.00
    1799.167     0.997266      6165143       365.71
    1841.151     0.997656      6167581       426.67
    1875.967     0.998047      6169953       512.00
    1895.423     0.998242      6171190       568.89
    1922.047     0.998437      6172360       640.00
    1974.271     0.998633      6173565       731.43
    1995.775     0.998828      6174794       853.33
    2015.231     0.999023      6176015      1024.00
    2029.567     0.999121      6176590      1137.78
    2058.239     0.999219      6177191      1280.00
    2089.983     0.999316      6177811      1462.86
    2109.439     0.999414      6178449      1706.67
    2125.823     0.999512      6179044      2048.00
    2131.967     0.999561      6179301      2275.56
    2140.159     0.999609      6179646      2560.00
    2144.255     0.999658      6179909      2925.71
    2150.399     0.999707      6180245      3413.33
    2156.543     0.999756      6180546      4096.00
    2160.639     0.999780      6180725      4551.11
    2162.687     0.999805      6180823      5120.00
    2166.783     0.999829      6181003      5851.43
    2170.879     0.999854      6181162      6826.67
    2174.975     0.999878      6181305      8192.00
    2177.023     0.999890      6181363      9102.22
    2179.071     0.999902      6181421     10240.00
    2181.119     0.999915      6181479     11702.86
    2185.215     0.999927      6181609     13653.33
    2187.263     0.999939      6181652     16384.00
    2189.311     0.999945      6181680     18204.44
    2193.407     0.999951      6181726     20480.00
    2195.455     0.999957      6181777     23405.71
    2197.503     0.999963      6181814     27306.67
    2199.551     0.999969      6181837     32768.00
    2199.551     0.999973      6181837     36408.89
    2203.647     0.999976      6181872     40960.00
    2205.695     0.999979      6181891     46811.43
    2207.743     0.999982      6181904     54613.33
    2209.791     0.999985      6181916     65536.00
    2211.839     0.999986      6181928     72817.78
    2213.887     0.999988      6181941     81920.00
    2213.887     0.999989      6181941     93622.86
    2215.935     0.999991      6181953    109226.67
    2217.983     0.999992      6181965    131072.00
    2217.983     0.999993      6181965    145635.56
    2220.031     0.999994      6181971    163840.00
    2222.079     0.999995      6181977    187245.71
    2224.127     0.999995      6181983    218453.33
    2224.127     0.999996      6181983    262144.00
    2226.175     0.999997      6181988    291271.11
    2226.175     0.999997      6181988    327680.00
    2228.223     0.999997      6181995    374491.43
    2228.223     0.999998      6181995    436906.67
    2228.223     0.999998      6181995    524288.00
    2230.271     0.999998      6182000    582542.22
    2230.271     0.999998      6182000    655360.00
    2230.271     0.999999      6182000    748982.86
    2230.271     0.999999      6182000    873813.33
    2232.319     0.999999      6182006   1048576.00
    2232.319     1.000000      6182006          inf
#[Mean    =      199.484, StdDeviation   =      322.345]
#[Max     =     2230.272, Total count    =      6182006]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7414176 requests in 1.00m, 367.68MB read
Requests/sec: 123520.40
Transfer/sec:      6.13MB