results/data/benchclient1/quarkus-io-thread-126000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 117.567ms, rate sampling interval: 642ms
  Thread calibration: mean lat.: 150.231ms, rate sampling interval: 847ms
  Thread calibration: mean lat.: 124.853ms, rate sampling interval: 679ms
  Thread calibration: mean lat.: 100.316ms, rate sampling interval: 489ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   756.82ms    1.03s    5.82s    84.26%
    Req/Sec    30.84k     1.07k   33.79k    68.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  260.35ms
 75.000%    1.09s 
 90.000%    2.32s 
 99.000%    4.56s 
 99.900%    5.54s 
 99.990%    5.78s 
 99.999%    5.82s 
100.000%    5.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.052     0.000000            1         1.00
      24.127     0.100000       614863         1.11
      41.791     0.200000      1230663         1.25
      68.031     0.300000      1844558         1.43
     123.583     0.400000      2459088         1.67
     260.351     0.500000      3073966         2.00
     362.751     0.550000      3381326         2.22
     500.735     0.600000      3688655         2.50
     666.623     0.650000      3995752         2.86
     851.967     0.700000      4303702         3.33
    1086.463     0.750000      4610885         4.00
    1243.135     0.775000      4765057         4.44
    1417.215     0.800000      4918260         5.00
    1617.919     0.825000      5072081         5.71
    1844.223     0.850000      5225538         6.67
    2068.479     0.875000      5379322         8.00
    2189.311     0.887500      5456411         8.89
    2316.287     0.900000      5533723        10.00
    2443.263     0.912500      5610051        11.43
    2586.623     0.925000      5686204        13.33
    2746.367     0.937500      5764130        16.00
    2822.143     0.943750      5801945        17.78
    2918.399     0.950000      5840110        20.00
    3047.423     0.956250      5878531        22.86
    3178.495     0.962500      5916806        26.67
    3348.479     0.968750      5955535        32.00
    3465.215     0.971875      5974332        35.56
    3606.527     0.975000      5993641        40.00
    3782.655     0.978125      6012876        45.71
    3999.743     0.981250      6032078        53.33
    4163.583     0.984375      6051252        64.00
    4251.647     0.985938      6061078        71.11
    4329.471     0.987500      6070492        80.00
    4440.063     0.989062      6079984        91.43
    4603.903     0.990625      6089614       106.67
    4751.359     0.992188      6099252       128.00
    4816.895     0.992969      6104254       142.22
    4870.143     0.993750      6109107       160.00
    4911.103     0.994531      6113691       182.86
    4964.351     0.995313      6118707       213.33
    5017.599     0.996094      6123293       256.00
    5046.271     0.996484      6125583       284.44
    5107.711     0.996875      6128057       320.00
    5185.535     0.997266      6130464       365.71
    5246.975     0.997656      6132871       426.67
    5332.991     0.998047      6135304       512.00
    5390.335     0.998242      6136468       568.89
    5439.487     0.998437      6137617       640.00
    5484.543     0.998633      6138889       731.43
    5517.311     0.998828      6140170       853.33
    5537.791     0.999023      6141206      1024.00
    5554.175     0.999121      6141901      1137.78
    5570.559     0.999219      6142458      1280.00
    5619.711     0.999316      6142992      1462.86
    5677.055     0.999414      6143611      1706.67
    5705.727     0.999512      6144273      2048.00
    5713.919     0.999561      6144494      2275.56
    5726.207     0.999609      6144868      2560.00
    5734.399     0.999658      6145107      2925.71
    5742.591     0.999707      6145399      3413.33
    5754.879     0.999756      6145764      4096.00
    5758.975     0.999780      6145906      4551.11
    5763.071     0.999805      6146032      5120.00
    5767.167     0.999829      6146175      5851.43
    5775.359     0.999854      6146417      6826.67
    5779.455     0.999878      6146543      8192.00
    5779.455     0.999890      6146543      9102.22
    5783.551     0.999902      6146641     10240.00
    5787.647     0.999915      6146728     11702.86
    5791.743     0.999927      6146781     13653.33
    5795.839     0.999939      6146835     16384.00
    5799.935     0.999945      6146900     18204.44
    5799.935     0.999951      6146900     20480.00
    5804.031     0.999957      6146973     23405.71
    5804.031     0.999963      6146973     27306.67
    5808.127     0.999969      6147036     32768.00
    5808.127     0.999973      6147036     36408.89
    5812.223     0.999976      6147108     40960.00
    5812.223     0.999979      6147108     46811.43
    5812.223     0.999982      6147108     54613.33
    5812.223     0.999985      6147108     65536.00
    5816.319     0.999986      6147172     72817.78
    5816.319     0.999988      6147172     81920.00
    5816.319     0.999989      6147172     93622.86
    5816.319     0.999991      6147172    109226.67
    5816.319     0.999992      6147172    131072.00
    5816.319     0.999993      6147172    145635.56
    5816.319     0.999994      6147172    163840.00
    5816.319     0.999995      6147172    187245.71
    5816.319     0.999995      6147172    218453.33
    5816.319     0.999996      6147172    262144.00
    5820.415     0.999997      6147194    291271.11
    5820.415     1.000000      6147194          inf
#[Mean    =      756.820, StdDeviation   =     1029.615]
#[Max     =     5816.320, Total count    =      6147194]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7386922 requests in 1.00m, 366.33MB read
Requests/sec: 123118.16
Transfer/sec:      6.11MB